app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?

        flash[:alert] = "Artist not found."
        redirect_to artists_path
      else
        @songs = @artist.songs
      end

    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 7]]
---
  def show





    # @song = Song.find_by(params[:id])
    # @artist = @song.artist



    # if params[:artist_id]
        # @song = Song.find_by(id: params[:id])
        # @artist = @song.artist

              # @artist = Artist.find_by(id: params[:artist_id])

        if Song.find_by(id: params[:id]).artist.nil?